proto-at-block/bitkey/firmware/lib/mpu_regions/inc/mpu_stm32u5xx.h
#pragma once

/*
 * STM32U5 peripheral address map (non-secure):
 *   APB1  0x40000000 - 0x4000FFFF  (IWDG, USART2/3, I2C1/2, etc.)
 *   APB2  0x40010000 - 0x4001FFFF  (USART1, SPI1, etc.)
 *   AHB1  0x40020000 - 0x4002FFFF  (GPDMA1, FLASH ctrl, CRC)
 *   AHB2  0x42020000 - 0x420D1FFF  (GPIO A-I, ADC1, OCTOSPI1 ctrl)
 *   APB3  0x46000000 - 0x4600FFFF  (SYSCFG, LPUART1, etc.)
 *   AHB3  0x46020000 - 0x46023FFF  (RCC, PWR, EXTI)
 *
 * FreeRTOS leaves 3 user MPU regions per task. Most tasks need at
 * least one region slot for data, so at most one or two slots remain
 * for peripherals. Ranges below are chosen to cover only the buses
 * that each task actually touches rather than the full 512 MB span.
 */

/* Full peripheral span (0x40000000–0x5FFFFFFF) – avoid where possible. */
#define MPU_PERIPHERAL_BASE_ADDR  ((void*)0x40000000)
#define MPU_PERIPHERAL_TOTAL_SIZE 0x20000000

/* ── Single-bus / individual peripherals ────────────────────────── */

/* IWDG – APB1 */
#define MPU_PERIPHERAL_IWDG_ADDR ((void*)0x40003000)
#define MPU_PERIPHERAL_IWDG_SIZE 0x400

/* USART2 – APB1 */
#define MPU_PERIPHERAL_USART2_ADDR ((void*)0x40004400)
#define MPU_PERIPHERAL_USART2_SIZE 0x400

/* USART3 – APB1 */
#define MPU_PERIPHERAL_USART3_ADDR ((void*)0x40004800)
#define MPU_PERIPHERAL_USART3_SIZE 0x400

/* I2C1 – APB1 */
#define MPU_PERIPHERAL_I2C1_ADDR ((void*)0x40005400)
#define MPU_PERIPHERAL_I2C1_SIZE 0x400

/* USART1 – APB2 */
#define MPU_PERIPHERAL_USART1_ADDR ((void*)0x40013800)
#define MPU_PERIPHERAL_USART1_SIZE 0x400

/* AHB1: GPDMA1, FLASH, CRC, TSC */
#define MPU_PERIPHERAL_AHB1_ADDR ((void*)0x40020000)
#define MPU_PERIPHERAL_AHB1_SIZE 0x00010000

/* GPDMA1 – AHB1 */
#define MPU_PERIPHERAL_GPDMA1_ADDR ((void*)0x40020000)
#define MPU_PERIPHERAL_GPDMA1_SIZE 0x1000

/* ICACHE – AHB1 */
#define MPU_PERIPHERAL_ICACHE_ADDR ((void*)0x40030400)
#define MPU_PERIPHERAL_ICACHE_SIZE 0x400

/* GPIO - AHB2 */
#define MPU_PERIPHERAL_GPIO_BLOCK_ADDR ((void*)0x42020000)
#define MPU_PERIPHERAL_GPIO_BLOCK_SIZE 0x00004000

/* GPIOA – AHB2 */
#define MPU_PERIPHERAL_GPIOA_ADDR ((void*)0x42020000)
#define MPU_PERIPHERAL_GPIOA_SIZE 0x400

/* GPIOB – AHB2 */
#define MPU_PERIPHERAL_GPIOB_ADDR ((void*)0x42020400)
#define MPU_PERIPHERAL_GPIOB_SIZE 0x400

/* GPIOC – AHB2 */
#define MPU_PERIPHERAL_GPIOC_ADDR ((void*)0x42020800)
#define MPU_PERIPHERAL_GPIOC_SIZE 0x400

/* GPIOD – AHB2 */
#define MPU_PERIPHERAL_GPIOD_ADDR ((void*)0x42020C00)
#define MPU_PERIPHERAL_GPIOD_SIZE 0x400

/* GPIOE – AHB2 */
#define MPU_PERIPHERAL_GPIOE_ADDR ((void*)0x42021000)
#define MPU_PERIPHERAL_GPIOE_SIZE 0x400

/* GPIOF – AHB2 */
#define MPU_PERIPHERAL_GPIOF_ADDR ((void*)0x42021400)
#define MPU_PERIPHERAL_GPIOF_SIZE 0x400

/* GPIOG – AHB2 */
#define MPU_PERIPHERAL_GPIOG_ADDR ((void*)0x42021800)
#define MPU_PERIPHERAL_GPIOG_SIZE 0x400

/* GPIOH – AHB2 */
#define MPU_PERIPHERAL_GPIOH_ADDR ((void*)0x42021C00)
#define MPU_PERIPHERAL_GPIOH_SIZE 0x400

/* GPIOI – AHB2 */
#define MPU_PERIPHERAL_GPIOI_ADDR ((void*)0x42022000)
#define MPU_PERIPHERAL_GPIOI_SIZE 0x400

/* PWR – AHB3 */
#define MPU_PERIPHERAL_PWR_ADDR ((void*)0x46020800)
#define MPU_PERIPHERAL_PWR_SIZE 0x400

/* RCC – AHB3 */
#define MPU_PERIPHERAL_RCC_ADDR ((void*)0x46020C00)
#define MPU_PERIPHERAL_RCC_SIZE 0x400
